import { LOCALES } from "./locale";

const am = {
  [LOCALES.ARMENIAN]: {
    subtitle:'React-ը JavaScript-ի գրադարան է',
    about:'React-ը թույլ է տալիս օգտատիրոջ միջերեսներ ստեղծել առանձին մասերից, որոնք կոչվում են բաղադրիչներ: Ստեղծեք ձեր սեփական React բաղադրիչները, ինչպիսիք են Thumbnail-ը, LikeButton-ը և Video-ը: Այնուհետև դրանք միացրեք ամբողջ էկրանների, էջերի և հավելվածների մեջ։',
    sectionTitle:'Ստեղծեք օգտվողի միջերեսներ բաղադրիչներից',
    mainTitle: 'Հավատարիմ մնացեք համացանցին',
    mainAbout:'Մարդիկ ակնկալում են, որ վեբ հավելվածների էջերը արագ կբեռնվեն: Սերվերում React-ը թույլ է տալիս սկսել HTML-ի հոսք, մինչ դեռ տվյալներ եք առբերում՝ աստիճանաբար լրացնելով մնացած բովանդակությունը՝ նախքան JavaScript-ի որևէ կոդ բեռնելը: Հաճախորդի վրա React-ը կարող է օգտագործել ստանդարտ վեբ API-ներ՝ ձեր միջերեսը արձագանքող պահելու համար նույնիսկ մատուցման կեսին: React մոտեցումները փոխվում են խնամքով: React-ի յուրաքանչյուր պարտավորություն փորձարկվում է բիզնեսի համար կարևոր մակերևույթների վրա, որտեղ կա ավելի քան մեկ միլիարդ օգտվող: Ավելի քան 100,000 React բաղադրիչներ Meta-ում օգնում են վավերացնել միգրացիոն յուրաքանչյուր ռազմավարություն:React թիմը միշտ ուսումնասիրում է, թե ինչպես բարելավել React-ը: Որոշ հետազոտություններ տեւում են տարիներ, որպեսզի արդյունք տան: React-ն ունի հետազոտական գաղափարը արտադրության մեջ մտցնելու բարձր նշաձող:',
    firstLi:'Սովորել React',
    secondLi:'API հղում',
    thirdLi:'Համայնք',
    fourthLi:'Ավելին'
  },
};
export default am;
