import { LOCALES } from "./locale";

const ru = {
  [LOCALES.RUSSIAN]: {
    subtitle:'Библиотека для веб-и собственных пользовательских интерфейсов.',
    about:'React позволяет создавать пользовательские интерфейсы из отдельных частей, называемых компонентами. Создайте свои собственные компоненты React, такие как Thumbnail, LikeButton и Video. Затем объедините их в целые экраны, страницы и приложения».',
    sectionTitle:'Создание пользовательских интерфейсов из компонентов',
    mainTitle: 'Оставайтесь верными Интернету',
    mainAbout:'Люди ожидают, что страницы веб-приложений будут загружаться быстро. На сервере React позволяет вам начать потоковую передачу HTML, пока вы все еще извлекаете данные, постепенно заполняя оставшийся контент до загрузки кода JavaScript. На клиенте React может использовать стандартные веб-API, чтобы ваш пользовательский интерфейс оставался отзывчивым даже в середине рендеринга.React подходит к изменениям с осторожностью. Каждый коммит React тестируется на критически важных для бизнеса поверхностях с участием более миллиарда пользователей. Более 100 000 компонентов React в Meta помогают проверить каждую стратегию миграции.Команда React постоянно исследует, как улучшить React. Некоторым исследованиям требуются годы, чтобы окупиться. У React высокая планка воплощения исследовательской идеи в производство.',
    firstLi:'Изучите React',
    secondLi:'Справочник по API',
    thirdLi:'Сообщество',
    fourthLi:'Более'
  },
};
export default ru;
